In [1]:
import pandas as pd

In [4]:
data = [
        {'Nombre': 'Camilo', 'Edad':25, 'Ciudad': 'Bucaramanga'},
        {'Nombre': 'Roman', 'Edad':16, 'Ciudad': 'Bogotá'},
        {'Nombre': 'Andrea', 'Edad':32, 'Ciudad': 'Cali'},
        {'Nombre': 'Luis', 'Edad':44, 'Ciudad': 'Medellín'}
       ]
df = pd.DataFrame(data)
df

   Nombre  Edad       Ciudad
0  Camilo    25  Bucaramanga
1   Roman    16       Bogotá
2  Andrea    32         Cali
3    Luis    44     Medellín

# DataFrame formado desde lista

In [8]:
datalist = {
    'Nombre': ['Camilo', 'Ana', 'Pedro', 'Marta'],
    'Edad': [25,16,34,12],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Sevilla']
}
df = pd.DataFrame(datalist)
df

   Nombre  Edad     Ciudad
0  Camilo    25     Madrid
1     Ana    16  Barcelona
2   Pedro    34   Valencia
3   Marta    12    Sevilla

#### Seleccionar columnas del Dataframe

In [9]:
nombres = df['Nombre']
nombres

0    Camilo
1       Ana
2     Pedro
3     Marta
Name: Nombre, dtype: object

#### Añadir columna

In [12]:
df['Salario'] = [30000, 40000, 25000, 32000]
df

   Nombre  Edad     Ciudad  Salario
0  Camilo    25     Madrid    30000
1     Ana    16  Barcelona    40000
2   Pedro    34   Valencia    25000
3   Marta    12    Sevilla    32000

#### Borrar columna

In [13]:
df.drop('Salario', axis=1, inplace=True)
df

   Nombre  Edad     Ciudad
0  Camilo    25     Madrid
1     Ana    16  Barcelona
2   Pedro    34   Valencia
3   Marta    12    Sevilla

#### Seleccionar filas por posición

In [15]:
primera_fila = df.iloc[3]
primera_fila

Nombre      Marta
Edad           12
Ciudad    Sevilla
Name: 3, dtype: object

####  Seleccionar filas por condiciones

In [22]:
datadux = {
    'Nombre': ['Camilo', 'Ana', 'Pedro', 'Marta', 'Ana'],
    'Edad': [25,16,None,12,56],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Sevilla', None]
}
df = pd.DataFrame(datadux)
df

   Nombre  Edad     Ciudad
0  Camilo  25.0     Madrid
1     Ana  16.0  Barcelona
2   Pedro   NaN   Valencia
3   Marta  12.0    Sevilla
4     Ana  56.0       None

In [17]:
df.loc[df['Nombre'] =='Ana']

  Nombre  Edad     Ciudad
1    Ana    16  Barcelona
4    Ana    56   Cataluña

In [18]:
df[df['Edad']<30]

   Nombre  Edad     Ciudad
0  Camilo    25     Madrid
1     Ana    16  Barcelona
3   Marta    12    Sevilla

#### Ordenar el Dataframe

In [19]:
df.sort_values(by='Edad', ascending=True)

   Nombre  Edad     Ciudad
3   Marta    12    Sevilla
1     Ana    16  Barcelona
0  Camilo    25     Madrid
2   Pedro    34   Valencia
4     Ana    56   Cataluña

In [20]:
df['Edad'].mean()

np.float64(28.6)

In [21]:
df['Edad'].max()

np.int64(56)

In [25]:
df_limpio =df.dropna() #Elimina filas con elementos vacios, no altera el dataframe sino que crea uno nuevo sin estos elementos.
df_limpio

   Nombre  Edad     Ciudad
0  Camilo  25.0     Madrid
1     Ana  16.0  Barcelona
3   Marta  12.0    Sevilla

#### Añadir Valor por default a las columas con valores vacios

In [26]:
df

   Nombre  Edad     Ciudad
0  Camilo  25.0     Madrid
1     Ana  16.0  Barcelona
2   Pedro   NaN   Valencia
3   Marta  12.0    Sevilla
4     Ana  56.0       None

In [30]:
df.fillna(value = {'Edad':22, 'Ciudad':'Medellín'}) # no altera el dataframe original a menos que lleve la instruccion inplace=True

   Nombre  Edad     Ciudad
0  Camilo  25.0     Madrid
1     Ana  16.0  Barcelona
2   Pedro  22.0   Valencia
3   Marta  12.0    Sevilla
4     Ana  56.0   Medellín